#!/usr/bin/env python
# -*- coding: utf-8 -*-
# File  : if基本语法.py
# Author: MuNian
# Date  : 2019/7/25

'''
Python对于零基础非常友好的
爬虫
数据分析
AI  机器学习
自动化测试
web 后端开发
....
就业岗位 全职 兼职  未来发展
计算机专业

4.5  个月 为一期
线上直播授课 + 课后录播 + 随堂笔记
1 3 5 正课   2  4 6 解答课  20:30 - 22:30

web全栈  web后端  爬虫  自动化测试
8K - 27K
基础 安之
学会才毕业
1. 课中测试 课后作业  课后解答 辅导 补课 一对一的
2. 保证学员学会才毕业  阶段考核 (重修(免费的))   项目实战检验 具备独立开发项目的能力
3. 毕业后职业规划
就业指导  就业跟踪 模拟BAT笔试面试

web --> 爬虫(训练集采集) --->  自动化 ---> 机器学习  深度学习 机器视觉 图像处理

数据分析师 --> 数据提取 --> 常用文件操作 ....
分期12(花呗 借呗 信用卡 京东白条)  一个月只要500多块钱就能学习了
1000学费优惠   办理入门 直接进入预科班学习
投资自己本身 不值得?


'''


age = 17

if age >= 18:
    print('可以进入网吧嗨皮..')


else:
    print('年龄未到  禁止进入.')
