#!/usr/bin/env python
# -*- coding: utf-8 -*-
# File  : 程序的执行原理.py
# Author: MuNian
# Date  : 2019/7/13
'''
CPU: 中央处理器  处理数据 计算
内存: 临时存储数据 断点之后数据就回消失  4G  8G  12G
硬盘: 永久存储数据  速度慢  固态(速度快 数据容易丢失) 机器

执行程序: CPU    内存速度快

qq:
 1. 读取用户输入的qq号码  qq密码  ----> 腾讯的服务器

变量名:
    标识符: 字母 数组 下划线 组成  不能以数字开头 不能和关键字重名
    命名规则:  标识符区分大小写的

就业趋势:
    自动化 自动化测试 自动化运维 web自动化 selenium + Python  Python + requests 接口测试 Locust 性能测试....  Robotframework自动化框架  10K
    web  开发效率高  豆瓣 知乎 ... flask   django  全栈开发  后端开发    15K
    爬虫  数据采集 ....

AI  算法  机器视觉 ......

4.5 快速就业
线上直播授课的 + 课后录播 + 随堂笔记
1 3 5 正课  2 4 6 解答课  20:30 - 22:30
学会才毕业的
VIP服务:
    1. 老师 学习计划制定
    2. 课中测试 课后作业 课后一对一解答  辅导  末尾补课  每日反馈
    3. 阶段考核 重修(学会才毕业)  项目实践检验 毕业后都具备独立开发项目的能力
    4. 就业服务: 就业指导 模拟BAT面试笔试  毕业后 制定职业规划  兼职 带着你去做一段时间

AI  薪资 需求  国务院 Python 高考  中小学..  计科
IT: 非程序员行业   微软 大力支持Python  谷歌
学费  ----> 8K
高薪


'''

# 赋值
Name_Lao = '老王'

import keyword
print(keyword.kwlist)

